Revit 2027 API
ParameterTypeId.RebarSpliceSpliceLinePosition Property
 "Splice Position"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSpliceSpliceLinePosition { get; }
Public Shared ReadOnly Property RebarSpliceSpliceLinePosition As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSpliceSpliceLinePosition {
	ForgeTypeId^ get ();
}
static member RebarSpliceSpliceLinePosition : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace